{
    "modelTopology": {
      "class_name": "Sequential",
      "config": {
        "name": "my_model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 224, 224, 3],
              "dtype": "float32",
              "name": "input_layer"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv_1",
              "filters": 32,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "same"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "pool_1",
              "pool_size": [2, 2],
              "padding": "valid"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "units": 128,
              "activation": "relu"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "output_layer",
              "units": 10,
              "activation": "softmax"
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "optimizer": {
        "class_name": "Adam",
        "config": {
          "learning_rate": 0.001
        }
      },
      "metrics": ["accuracy"]
    },
    "format": "layers-model",
    "generatedBy": "TensorFlow.js",
    "convertedBy": "TensorFlow.js Converter",
    "weightSpecs": [
      {
        "name": "conv_1/kernel",
        "shape": [3, 3, 3, 32],
        "dtype": "float32"
      },
      {
        "name": "conv_1/bias",
        "shape": [32],
        "dtype": "float32"
      },
      {
        "name": "dense_1/kernel",
        "shape": [50176, 128],
        "dtype": "float32"
      },
      {
        "name": "dense_1/bias",
        "shape": [128],
        "dtype": "float32"
      },
      {
        "name": "output_layer/kernel",
        "shape": [128, 10],
        "dtype": "float32"
      },
      {
        "name": "output_layer/bias",
        "shape": [10],
        "dtype": "float32"
      }
    ]
  }
  